urzino/FanMonitoringBlueCoin/STM32CubeFunctionPack_ALLMEMS1_V3.2.0/Projects/Multi/Applications/ALLMEMS1/Src/sensor_service.c
/**
  ******************************************************************************
  * @file    sensor_service.c
  * @author  Central LAB
  * @version V3.2.0
  * @date    30-Sep-2017
  * @brief   Add 4 bluetooth services using vendor specific profiles.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2017 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#include <stdio.h>
#include "TargetFeatures.h"
#include "main.h"
#include "MetaDataManager.h"
#include "sensor_service.h"
#include "console.h"
#include "HWAdvanceFeatures.h"
#include "bluenrg_utils.h"
#include "bluenrg_l2cap_aci.h"
#include "uuid_ble_service.h"
#include "OTA.h"

#ifdef ALLMEMS1_ENABLE_SD_MEMS_RECORDING
#include "DataLog_Manager.h"
#endif /* ALLMEMS1_ENABLE_SD_MEMS_RECORDING */ 

/* Exported variables ---------------------------------------------------------*/
int connected = FALSE;
uint8_t set_connectable = TRUE;

#ifdef ALLMEMS1_ACOUSTIC_BEAM_FORMING    
volatile uint8_t BF_toggleFlag = FALSE;
#endif /* ALLMEMS1_ACOUSTIC_BEAM_FORMING */

uint8_t IsSdMemsRecording= 0;
uint8_t IsSdAudioRecording= 0;

volatile uint32_t FeatureMask;

/* Imported Variables -------------------------------------------------------------*/
extern uint32_t ConnectionBleStatus;

/* Code for MotionFX integration - Start Section */
extern SensorAxes_t MAG_Offset;
/* Code for MotionFX integration - End Section */

/* Code for MotionAR integration - Start Section */
extern MAR_output_t ActivityCode;
/* Code for MotionAR integration - End Section */

#ifdef ALLMEMS1_MOTIONCP
extern MCP_output_t CarryPositionCode;
#endif /* ALLMEMS1_MOTIONCP */

#ifdef ALLMEMS1_MOTIONGR
extern MGR_output_t GestureRecognitionCode;
#endif /* ALLMEMS1_MOTIONGR */

extern uint32_t ForceReCalibration;
extern unsigned char isCal;
  
extern uint32_t FirstConnectionConfig;

extern TIM_HandleTypeDef    TimCCHandle;
extern TIM_HandleTypeDef    TimEnvHandle;
extern TIM_HandleTypeDef    TimAudioDataHandle;

#ifdef STM32_BLUECOIN
extern volatile uint8_t InitVoltageFilter;
#endif /* STM32_BLUECOIN */

#ifdef ALLMEMS1_ENABLE_SD_MEMS_RECORDING
extern TIM_HandleTypeDef    TimSdRecordingHandle;
extern volatile uint8_t SD_CardNotPresent;
extern volatile uint8_t writeAudio_flag;
#endif /* ALLMEMS1_ENABLE_SD_MEMS_RECORDING */
extern volatile float RMS_Ch[];
extern float DBNOISE_Value_Old_Ch[];

#ifdef ALLMEMS1_ACOUSTIC_BEAM_FORMING
extern int32_t BF_dir;
#endif /* ALLMEMS1_ACOUSTIC_BEAM_FORMING */

extern uint8_t bdaddr[6];

extern uint32_t uhCCR4_Val;

/* Private variables ------------------------------------------------------------*/
#ifdef DISABLE_FOTA
static uint32_t FirstCommandSent= 1;
#endif /* DISABLE_FOTA */

static uint16_t HWServW2STHandle;
static uint16_t EnvironmentalCharHandle;
static uint16_t AccGyroMagCharHandle;
static uint16_t AccEventCharHandle;
static uint16_t AudioLevelCharHandle;

//#ifdef STM32_SENSORTILE
#if (defined(STM32_SENSORTILE) || defined(STM32_BLUECOIN))
static uint16_t GGCharHandle;
#endif /* STM32_SENSORTILE */

/* Code for MotionFX integration - Start Section */
static uint16_t QuaternionsCharHandle;
static uint16_t ECompassCharHandle;
/* Code for MotionFX integration - End Section */

/* Code for MotionAR integration - Start Section */
static uint16_t ActivityRecCharHandle;
/* Code for MotionAR integration - End Section */

#ifdef ALLMEMS1_MOTIONCP
static uint16_t CarryPosRecCharHandle;
#endif /* ALLMEMS1_MOTIONCP */

#ifdef ALLMEMS1_MOTIONGR
static uint16_t GestureRecCharHandle;
#endif /* ALLMEMS1_MOTIONGR */

#ifdef ALLMEMS1_ACOUSTIC_SOURCE_LOCALIZATION
uint16_t AudioSourceLocalizationCharHandle;
#endif /* ALLMEMS1_ACOUSTIC_SOURCE_LOCALIZATION */

#ifdef ALLMEMS1_ACOUSTIC_BEAM_FORMING
uint16_t AudioBeamformingCharHandle;
#endif /* ALLMEMS1_ACOUSTIC_BEAM_FORMING */

/* Code for BlueVoice integration - Start Section */
BV_ADPCM_ProfileHandle_t BLUEVOICE_tx_handle;
BV_ADPCM_uuid_t BLUEVOICE_Char_uuids;
/* Code for BlueVoice integration - End Section */

static uint16_t ConfigServW2STHandle;
static uint16_t ConfigCharHandle;

static uint16_t ConsoleW2STHandle;
static uint16_t TermCharHandle;
static uint16_t StdErrCharHandle;

static uint8_t LastStderrBuffer[W2ST_CONSOLE_MAX_CHAR_LEN];
static uint8_t LastStderrLen;
static uint8_t LastTermBuffer[W2ST_CONSOLE_MAX_CHAR_LEN];
static uint8_t LastTermLen;

