urzino/FanMonitoringBlueCoin/STM32CubeFunctionPack_ALLMEMS1_V3.2.0/Projects/Multi/Applications/ALLMEMS1/Src/sensor_service.c
  uint8_t buff[2+2+2+2+1];

  STORE_LE_16(buff  ,(HAL_GetTick()>>3));
  STORE_LE_16(buff+2,soc*10);
  STORE_LE_16(buff+4,voltage);
  STORE_LE_16(buff+6,current);

  if(soc<15) {
    /* if it's < 15% Low Battery*/
	buff[8] = 0x00; /* Low Battery */
  } else {
    //static uint32_t PreVoltage = 0;
    static uint32_t Status     = 0x04; /* Unknown */
    //if(PreVoltage!=0)
    {
      //if(PreVoltage>voltage) 
      if(current < 0)
      {
        Status = 0x01; /* Discharging */
      } else /* if(PreVoltage<voltage) */ {
        Status = 0x03; /* Charging */
      }
    }
    buff[8] = Status;
    //PreVoltage = voltage;
  }

  ret = aci_gatt_update_char_value(HWServW2STHandle, GGCharHandle, 0, 2+2+2+2+1,buff);

  if (ret != BLE_STATUS_SUCCESS){
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)){
      BytesToWrite = sprintf((char *)BufferToWrite, "Error Updating GG Char\r\n");
      Stderr_Update(BufferToWrite,BytesToWrite);
    } else {
      ALLMEMS1_PRINTF("Error Updating GG Char\r\n");
    }
    return BLE_STATUS_ERROR;
  }
  return BLE_STATUS_SUCCESS;
}
#endif /* STM32_SENSORTILE */

#ifdef STM32_BLUECOIN
/**
 * @brief  Update battery info characteristic value
 * @param  None
 * @retval tBleStatus   Status
 */
tBleStatus BatteryInfoUpdate(uint32_t voltage, ChrgStatus_t BattStatus, uint32_t soc)
{
  tBleStatus ret;
  static uint32_t Status;

  uint8_t buff[2+2+2+2+1];

  STORE_LE_16(buff  ,(HAL_GetTick()>>3));
  STORE_LE_16(buff+2,soc*10);
  STORE_LE_16(buff+4,voltage);
  STORE_LE_16(buff+6,0x8000);
  
  if(soc < 15)
  {
    /* if it's < 15% Low Battery*/
    Status = 0x00; /* Low Battery */
  }
  else
  {
    switch(BattStatus)
    {
    case CHRG_STATUS_DISCHARGING:
      Status = 0x01; /* Discharging */
      break;
    case CHRG_STATUS_EOC:
      Status = 0x02; /* Plagged Not Charging */
      break;
    case CHRG_STATUS_CHARGING:
      Status = 0x03; /* Charging */
      break;
    }
  }
  
  buff[8] = Status;

  ret = aci_gatt_update_char_value(HWServW2STHandle, GGCharHandle, 0, 2+2+2+2+1,buff);

  if (ret != BLE_STATUS_SUCCESS){
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)){
      BytesToWrite = sprintf((char *)BufferToWrite, "Error Updating GG Char\r\n");
      Stderr_Update(BufferToWrite,BytesToWrite);
    } else {
      ALLMEMS1_PRINTF("Error Updating GG Char\r\n");
    }
    return BLE_STATUS_ERROR;
  }
  return BLE_STATUS_SUCCESS;
}
#endif /* STM32_BLUECOIN */

#ifdef ALLMEMS1_ACOUSTIC_SOURCE_LOCALIZATION

/**
 * @brief  Update Microphones characteristic values
 * @param  uint16_t Angle
 * @retval tBleStatus   Status
 */
tBleStatus AudioSourceLocalization_Update(uint16_t Angle)
{  
  tBleStatus ret;
  
  uint8_t buff[2+2];

  STORE_LE_16(buff  ,(HAL_GetTick()>>3));
  STORE_LE_16(buff+2  ,Angle);
    
  ret = ACI_GATT_UPDATE_CHAR_VALUE(HWServW2STHandle, AudioSourceLocalizationCharHandle, 0, 2+2, buff);

  if (ret != BLE_STATUS_SUCCESS){
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)){
      BytesToWrite = sprintf((char *)BufferToWrite, "Error Updating Mic Audio Source Localization Data Char\r\n");
      Stderr_Update(BufferToWrite,BytesToWrite);
    }
    return BLE_STATUS_ERROR;
  }
  return BLE_STATUS_SUCCESS;	
}
#endif /* ALLMEMS1_ACOUSTIC_SOURCE_LOCALIZATION */

/**
 * @brief  Puts the device in connectable mode.
 * @param  None 
 * @retval None
 */
void setConnectable(void)
{  
  char local_name[8] = {AD_TYPE_COMPLETE_LOCAL_NAME,NAME_BLUEMS};
  uint8_t manuf_data[26] = {
    2,0x0A,0x00 /* 0 dBm */, // Trasmission Power
    8,0x09,NAME_BLUEMS, // Complete Name
    13,0xFF,0x01/*SKD version */,
#ifdef  STM32_NUCLEO
    0x80,
#elif STM32_SENSORTILE
    0x02,
#elif STM32_BLUECOIN
    0x03,
#endif /* STM32_NUCLEO */
    0x00 /* AudioSync+AudioData */,
    0xE0 /* ACC+Gyro+Mag*/,
    0x00 /*  */,
    0x00, /*  */
    0x00, /* BLE MAC start */
    0x00,
    0x00,
    0x00,
    0x00,
    0x00, /* BLE MAC stop */
  };
  
  /* BLE MAC */
  manuf_data[20] = bdaddr[5];
  manuf_data[21] = bdaddr[4];
  manuf_data[22] = bdaddr[3];
  manuf_data[23] = bdaddr[2];
  manuf_data[24] = bdaddr[1];
  manuf_data[25] = bdaddr[0];

#if (defined(STM32_SENSORTILE) || defined(STM32_BLUECOIN))
#ifdef STM32_SENSORTILE
  if(TargetBoardFeatures.HandleGGComponent)
#endif /* STM32_SENSORTILE */
  {
    manuf_data[17] |= 0x02; /* Battery Present */
  }
#endif /* STM32_SENSORTILE */
  
  //if(TargetBoardFeatures.NumMicSensors!=0) {
    manuf_data[16] |= 0x04; /* Mic */
  //}

  if(TargetBoardFeatures.NumTempSensors==2) {
    manuf_data[17] |= 0x05; /* Two Temperature values*/
  } else if(TargetBoardFeatures.NumTempSensors==1) {
    manuf_data[17] |= 0x04; /* One Temperature value*/
  }

  if(TargetBoardFeatures.HandleHumSensor) {
    manuf_data[17] |= 0x08; /* Humidity */
  }

  if(TargetBoardFeatures.HandlePressSensor) {
    manuf_data[17] |= 0x10; /* Pressure value*/
  }
  
#ifdef ALLMEMS1_ACOUSTIC_BEAM_FORMING
  if(TargetBoardFeatures.AcousticBFIsInitalized) {    
    /* Beamforming control */
    manuf_data[18] |=0x08;    
  }
#endif
  
  /* DS3 DIL24  present*/
  if(TargetBoardFeatures.HWAdvanceFeatures) {    
    /* Accelerometer Events */
    manuf_data[18] |=0x04;    
  }
  
  /* Code for MotionFX integration - Start Section */
  if(TargetBoardFeatures.MotionFXIsInitalized) {
    manuf_data[18] |= 0x01;
    /* Only for IDB05A1 */
    if(TargetBoardFeatures.bnrg_expansion_board == IDB05A1) {
      /* ECompass */
      manuf_data[19] |= 0x40;
    }
  }
  /* Code for MotionFX integration - End Section */

  /* Code for MotionAR integration - Start Section */
  if(TargetBoardFeatures.MotionARIsInitalized) {
    manuf_data[19] |= 0x10;
  }
  /* Code for MotionAR integration - End Section */

  #ifdef ALLMEMS1_MOTIONCP
  if(TargetBoardFeatures.MotionCPIsInitalized) {
    manuf_data[19] |= 0x08;
  }
  #endif /* ALLMEMS1_MOTIONCP */

  #ifdef ALLMEMS1_MOTIONGR
  if(TargetBoardFeatures.MotionGRIsInitalized) {
    manuf_data[19] |= 0x02;
  }
  #endif /* ALLMEMS1_MOTIONGR */

  /* Code for BlueVoice integration - Start Section */
  if(TargetBoardFeatures.AudioBVIsInitalized) {
    manuf_data[16] |= 0x48; /* AudioSync+AudioData */
  }
  /* Code for BlueVoice integration - End Section */
  
