urzino/FanMonitoringBlueCoin/STM32CubeFunctionPack_ALLMEMS1_V3.2.0/Projects/Multi/Applications/ALLMEMS1/Src/sensor_service.c
      if(BSP_TEMPERATURE_IsInitialized(TargetBoardFeatures.HandleTempSensors[1],&Status)==COMPONENT_OK){
        BSP_TEMPERATURE_Get_Temp(TargetBoardFeatures.HandleTempSensors[1],(float *)&SensorValue);
        MCR_BLUEMS_F2I_1D(SensorValue, intPart, decPart);
        Temp2ToSend = intPart*10+decPart; 
      }
    } else if(TargetBoardFeatures.NumTempSensors==1) {
      if(BSP_TEMPERATURE_IsInitialized(TargetBoardFeatures.HandleTempSensors[0],&Status)==COMPONENT_OK){
        BSP_TEMPERATURE_Get_Temp(TargetBoardFeatures.HandleTempSensors[0],(float *)&SensorValue);
        MCR_BLUEMS_F2I_1D(SensorValue, intPart, decPart);
        Temp1ToSend = intPart*10+decPart; 
      }
    }
    Environmental_Update(PressToSend,HumToSend,Temp2ToSend,Temp1ToSend);
  } else if(handle == AccEventCharHandle +1) {
    /* Read Request for Acc Pedometer DS3 */
    if(TargetBoardFeatures.HWAdvanceFeatures){
      uint16_t StepCount;
      if(W2ST_CHECK_HW_FEATURE(W2ST_HWF_PEDOMETER)) {
        StepCount = GetStepHWPedometer();
      } else {
        StepCount = 0;
      }
      AccEvent_Notify(StepCount, 2);
    }
  } else if (handle == StdErrCharHandle + 1) {
    /* Send again the last packet for StdError */
    Stderr_Update_AfterRead();
  } else if (handle == TermCharHandle + 1) {
    /* Send again the last packet for Terminal */
    Term_Update_AfterRead();
  /* Code for MotionAR integration - Start Section */
  } else if(handle == ActivityRecCharHandle + 1){
     ActivityRec_Update(ActivityCode);
  /* Code for MotionAR integration - End Section */
  #ifdef ALLMEMS1_MOTIONCP
  } else if(handle == CarryPosRecCharHandle + 1){
    CarryPosRec_Update(CarryPositionCode);
  #endif /* ALLMEMS1_MOTIONCP */
    
  #ifdef ALLMEMS1_MOTIONGR
  } else if(handle == GestureRecCharHandle + 1){
    GestureRec_Update(GestureRecognitionCode);
  #endif /* ALLMEMS1_MOTIONGR */
    
#ifdef STM32_SENSORTILE
  } else if(handle == GGCharHandle + 1){
    
    uint32_t voltage, soc;
    int32_t current;
    uint8_t v_mode;

    /* Update Gas Gouge Status */
    BSP_GG_Task(TargetBoardFeatures.HandleGGComponent,&v_mode);

    /* Read the Gas Gouge Status */
    BSP_GG_GetVoltage(TargetBoardFeatures.HandleGGComponent, &voltage);
    BSP_GG_GetCurrent(TargetBoardFeatures.HandleGGComponent, &current);
    BSP_GG_GetSOC(TargetBoardFeatures.HandleGGComponent, &soc);
    
    GG_Update(soc, voltage, current);
#endif /* STM32_SENSORTILE */
  }

  //EXIT:
  if(connection_handle != 0)
    aci_gatt_allow_read(connection_handle);
}

/**
 * @brief  This function is called when there is a change on the gatt attribute
 * With this function it's possible to understand if one application 
 * is subscribed or not to the one service
 * @param uint16_t att_handle Handle of the attribute
 * @param uint8_t *att_data attribute data
 * @param uint8_t data_length length of the data
 * @retval None
 */
void Attribute_Modified_CB(uint16_t attr_handle, uint8_t * att_data, uint8_t data_length)
{
  if( (!IsSdMemsRecording) && (!IsSdAudioRecording))
  {
    /* Code for BlueVoice integration - Start Section */
    if(TargetBoardFeatures.AudioBVIsInitalized){
     BluevoiceADPCM_AttributeModified_CB(attr_handle, data_length, att_data);
    }
    /* Code for BlueVoice integration - End Section */

     if(attr_handle == QuaternionsCharHandle + 2){
      if (att_data[0] == 01) {
        W2ST_ON_CONNECTION(W2ST_CONNECT_QUAT);

        /* Start the TIM Base generation in interrupt mode */
        if(HAL_TIM_OC_Start_IT(&TimCCHandle, TIM_CHANNEL_1) != HAL_OK){
          /* Starting Error */
          Error_Handler();
        }
        /* Set the new Capture compare value */
        {
          uint32_t uhCapture = __HAL_TIM_GET_COUNTER(&TimCCHandle);
          /* Set the Capture Compare Register value */
          __HAL_TIM_SET_COMPARE(&TimCCHandle, TIM_CHANNEL_1, (uhCapture + DEFAULT_uhCCR1_Val));
        }
      } else if (att_data[0] == 0){
        W2ST_OFF_CONNECTION(W2ST_CONNECT_QUAT);

        /* Stop the TIM Base generation in interrupt mode */
        if(HAL_TIM_OC_Stop_IT(&TimCCHandle, TIM_CHANNEL_1) != HAL_OK){
          /* Stopping Error */
          Error_Handler();
        }
      }
  #ifdef ALLMEMS1_DEBUG_CONNECTION
      if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
        BytesToWrite =sprintf((char *)BufferToWrite,"--->Quater=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_QUAT) ? " ON\r\n" : " OFF\r\n\n");
       Term_Update(BufferToWrite,BytesToWrite);
      } else
        ALLMEMS1_PRINTF("--->Quater=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_QUAT) ? " ON\r\n" : " OFF\r\n\n");
  #endif /* ALLMEMS1_DEBUG_CONNECTION */
    }
    else if(attr_handle == ECompassCharHandle + 2){
      if (att_data[0] == 01) {
        W2ST_ON_CONNECTION(W2ST_CONNECT_EC);

        /* Start the TIM Base generation in interrupt mode */
        if(HAL_TIM_OC_Start_IT(&TimCCHandle, TIM_CHANNEL_1) != HAL_OK){
          /* Starting Error */
          Error_Handler();
        }
        /* Set the new Capture compare value */
        {
          uint32_t uhCapture = __HAL_TIM_GET_COUNTER(&TimCCHandle);
          /* Set the Capture Compare Register value */
          __HAL_TIM_SET_COMPARE(&TimCCHandle, TIM_CHANNEL_1, (uhCapture + DEFAULT_uhCCR1_Val));
        }
      } else if (att_data[0] == 0){
        W2ST_OFF_CONNECTION(W2ST_CONNECT_EC);

        /* Stop the TIM Base generation in interrupt mode */
        if(HAL_TIM_OC_Stop_IT(&TimCCHandle, TIM_CHANNEL_1) != HAL_OK){
          /* Stopping Error */
          Error_Handler();
        }
      }
  #ifdef ALLMEMS1_DEBUG_CONNECTION
      if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
        BytesToWrite =sprintf((char *)BufferToWrite,"--->ECompass=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_EC) ? " ON\r\n" : " OFF\r\n\n");
       Term_Update(BufferToWrite,BytesToWrite);
      } else
        ALLMEMS1_PRINTF("--->ECompass=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_EC) ? " ON\r\n" : " OFF\r\n\n");
  #endif /* ALLMEMS1_DEBUG_CONNECTION */
    }
    /* Code for BlueVoice integration - Start Section */
    else if(attr_handle == BLUEVOICE_tx_handle.CharAudioHandle + 2){
      if(att_data[0] == 01){
        
        InitMics(BV_AUDIO_SAMPLING_FREQUENCY, BV_AUDIO_VOLUME_VALUE);
        
        W2ST_ON_CONNECTION(W2ST_CONNECT_BV_AUDIO);
      } else if (att_data[0] == 0){
  #ifndef ALLMEMS1_ENABLE_SD_MEMS_RECORDING
        LedOffTargetPlatform();
  #endif /* ALLMEMS1_ENABLE_SD_MEMS_RECORDING */
        
