urzino/FanMonitoringBlueCoin/STM32CubeFunctionPack_ALLMEMS1_V3.2.0/Projects/Multi/Applications/ALLMEMS1/Src/sensor_service.c
        DeInitMics();
        
        W2ST_OFF_CONNECTION(W2ST_CONNECT_BV_AUDIO);
      }
  #ifdef ALLMEMS1_DEBUG_CONNECTION
      if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
        BytesToWrite =sprintf((char *)BufferToWrite,"--->BV_ADPCM=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_BV_AUDIO) ? " ON\r\n" : " OFF\r\n");
       Term_Update(BufferToWrite,BytesToWrite);
      } else
        ALLMEMS1_PRINTF("--->BV_ADPCM=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_BV_AUDIO) ? " ON\r\n" : " OFF\r\n");
  #endif /* ALLMEMS1_DEBUG_CONNECTION */
    }else if(attr_handle == BLUEVOICE_tx_handle.CharAudioSyncHandle + 2){
      if(att_data[0] == 01){      
        W2ST_ON_CONNECTION(W2ST_CONNECT_BV_SYNC);
      } else if (att_data[0] == 0){
        W2ST_OFF_CONNECTION(W2ST_CONNECT_BV_SYNC);
      }
  #ifdef ALLMEMS1_DEBUG_CONNECTION   
      if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
        BytesToWrite =sprintf((char *)BufferToWrite,"--->BV_ADPCM_Sync=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_BV_SYNC) ? " ON\r\n" : " OFF\r\n");
       Term_Update(BufferToWrite,BytesToWrite);
      } else
        ALLMEMS1_PRINTF("--->BV_ADPCM_Sync=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_BV_SYNC) ? " ON\r\n" : " OFF\r\n");
  #endif /* ALLMEMS1_DEBUG_CONNECTION */
    }
    /* Code for BlueVoice integration - End Section */ 
    /* Code for MotionAR integration - Start Section */
     else if(attr_handle == ActivityRecCharHandle + 2){
       if (att_data[0] == 01) {

         Set4GAccelerometerFullScale();

         W2ST_ON_CONNECTION(W2ST_CONNECT_AR);

        /* Start the TIM Base generation in interrupt mode */
        if(HAL_TIM_OC_Start_IT(&TimCCHandle, TIM_CHANNEL_3) != HAL_OK){
          /* Starting Error */
          Error_Handler();
        }
        /* Set the new Capture compare value */
        {
          uint32_t uhCapture = __HAL_TIM_GET_COUNTER(&TimCCHandle);
          /* Set the Capture Compare Register value */
          __HAL_TIM_SET_COMPARE(&TimCCHandle, TIM_CHANNEL_3, (uhCapture + DEFAULT_uhCCR3_Val));
        }
       } else if (att_data[0] == 0){

         Set2GAccelerometerFullScale();

         W2ST_OFF_CONNECTION(W2ST_CONNECT_AR);

        /* Stop the TIM Base generation in interrupt mode */
        if(HAL_TIM_OC_Stop_IT(&TimCCHandle, TIM_CHANNEL_3) != HAL_OK){
          /* Stopping Error */
          Error_Handler();
        }
       }
  #ifdef ALLMEMS1_DEBUG_CONNECTION
       if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
         BytesToWrite =sprintf((char *)BufferToWrite,"--->ActRec=%s",  W2ST_CHECK_CONNECTION(W2ST_CONNECT_AR) ? " ON\r\n" : " OFF\r\n\n");
         Term_Update(BufferToWrite,BytesToWrite);
       } else
         ALLMEMS1_PRINTF("--->ActRec=%s",  W2ST_CHECK_CONNECTION(W2ST_CONNECT_AR) ? " ON\r\n" : " OFF\r\n\n");
  #endif /* ALLMEMS1_DEBUG_CONNECTION */
     }
    /* Code for MotionAR integration - End Section */
    #ifdef ALLMEMS1_MOTIONCP
     else if(attr_handle == CarryPosRecCharHandle + 2){
       if (att_data[0] == 01) {

        Set4GAccelerometerFullScale();

         W2ST_ON_CONNECTION(W2ST_CONNECT_CP);

        /* Start the TIM Base generation in interrupt mode */
        if(HAL_TIM_OC_Start_IT(&TimCCHandle, TIM_CHANNEL_2) != HAL_OK){
          /* Starting Error */
          Error_Handler();
        }
        /* Set the new Capture compare value */
        {
          uint32_t uhCapture = __HAL_TIM_GET_COUNTER(&TimCCHandle);
          /* Set the Capture Compare Register value */
          __HAL_TIM_SET_COMPARE(&TimCCHandle, TIM_CHANNEL_2, (uhCapture + DEFAULT_uhCCR2_Val));
        }
       } else if (att_data[0] == 0){

         Set2GAccelerometerFullScale();

         W2ST_OFF_CONNECTION(W2ST_CONNECT_CP);

         /* Stop the TIM Base generation in interrupt mode */
        if(HAL_TIM_OC_Stop_IT(&TimCCHandle, TIM_CHANNEL_2) != HAL_OK){
          /* Stopping Error */
          Error_Handler();
        }
       }
  #ifdef ALLMEMS1_DEBUG_CONNECTION
       if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
         BytesToWrite =sprintf((char *)BufferToWrite,"--->CarryPosRec=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_CP) ? " ON\r\n" : " OFF\r\n\n");
         Term_Update(BufferToWrite,BytesToWrite);
       } else
         ALLMEMS1_PRINTF("--->CarryPosRec=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_CP) ? " ON\r\n" : " OFF\r\n\n");
  #endif /* ALLMEMS1_DEBUG_CONNECTION */
    }
    #endif /* ALLMEMS1_MOTIONCP */
    #ifdef ALLMEMS1_MOTIONGR
     else if(attr_handle == GestureRecCharHandle + 2){
       if (att_data[0] == 01) {

         Set4GAccelerometerFullScale();

         W2ST_ON_CONNECTION(W2ST_CONNECT_GR);

        /* Start the TIM Base generation in interrupt mode */
        if(HAL_TIM_OC_Start_IT(&TimCCHandle, TIM_CHANNEL_2) != HAL_OK){
          /* Starting Error */
          Error_Handler();
        }
        /* Set the new Capture compare value */
        {
          uint32_t uhCapture = __HAL_TIM_GET_COUNTER(&TimCCHandle);
          /* Set the Capture Compare Register value */
          __HAL_TIM_SET_COMPARE(&TimCCHandle, TIM_CHANNEL_2, (uhCapture + DEFAULT_uhCCR2_Val));
        }
       } else if (att_data[0] == 0){

         Set2GAccelerometerFullScale();

         W2ST_OFF_CONNECTION(W2ST_CONNECT_GR);

         /* Stop the TIM Base generation in interrupt mode */
        if(HAL_TIM_OC_Stop_IT(&TimCCHandle, TIM_CHANNEL_2) != HAL_OK){
          /* Stopping Error */
          Error_Handler();
        }
       }
  #ifdef ALLMEMS1_DEBUG_CONNECTION
       if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
         BytesToWrite =sprintf((char *)BufferToWrite,"--->GestureRec=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_GR) ? " ON\r\n" : " OFF\r\n\n");
         Term_Update(BufferToWrite,BytesToWrite);
       } else
         ALLMEMS1_PRINTF("--->GestureRec=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_GR) ? " ON\r\n" : " OFF\r\n\n");
  #endif /* ALLMEMS1_DEBUG_CONNECTION */
    }
    #endif /* ALLMEMS1_MOTIONGR */
  #ifdef ALLMEMS1_ACOUSTIC_SOURCE_LOCALIZATION  
    else if ( attr_handle == AudioSourceLocalizationCharHandle + 2) {
      //uint8_t ret;
      if (att_data[0] == 01)
      {
        W2ST_ON_CONNECTION(W2ST_CONNECT_SL);
        //DeInitMics();
        InitMics(AUDIO_SAMPLING_FREQUENCY, AUDIO_VOLUME_VALUE);
        
        /* Start the TIM Base generation in interrupt mode */
        if(HAL_TIM_Base_Start_IT(&TimAudioDataHandle) != HAL_OK){
          /* Starting Error */
          Error_Handler();
        }
      }
      else if (att_data[0] == 0)
      {
        W2ST_OFF_CONNECTION(W2ST_CONNECT_SL);
        DeInitMics();
        
        /* Stop the TIM Base generation in interrupt mode */
        if(HAL_TIM_Base_Stop_IT(&TimAudioDataHandle) != HAL_OK){
          /* Stopping Error */
          Error_Handler();
        }
    
  #ifdef STM32_BLUECOIN
        BSP_LED_Off(LED1);
        BSP_LED_Off(LED2);
        BSP_LED_Off(LED3);
        BSP_LED_Off(LED4);
        BSP_LED_Off(LED5);
        BSP_LED_Off(LED6);
        BSP_LED_Off(LED7);
        BSP_LED_Off(LED8);
  #endif /* STM32_BLUECOIN */
      }
  #ifdef ALLMEMS1_DEBUG_CONNECTION
      if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
        BytesToWrite = sprintf((char *)BufferToWrite,"--->AudioSourceLocalization=%s", (W2ST_CHECK_CONNECTION(W2ST_CONNECT_SL)   ? " ON\r\n" : " OFF\r\n\n"));
       Term_Update(BufferToWrite,BytesToWrite);
      } else {
        ALLMEMS1_PRINTF("--->AudioSourceLocalization=%s", (W2ST_CHECK_CONNECTION(W2ST_CONNECT_SL)   ? " ON\r\n" : " OFF\r\n\n"));
      }
  #endif /* ALLMEMS1_DEBUG_CONNECTION */ 
    }
  #endif /* ALLMEMS1_ACOUSTIC_SOURCE_LOCALIZATION */
  #ifdef ALLMEMS1_ACOUSTIC_BEAM_FORMING
    else if ( attr_handle == AudioBeamformingCharHandle + 2) {
      if (att_data[0] == 01)
      {
        W2ST_ON_CONNECTION(W2ST_CONNECT_BF);
      }
      else if (att_data[0] == 0)
      {
        W2ST_OFF_CONNECTION(W2ST_CONNECT_BF);
        BF_toggleFlag = FALSE;
      }
  #ifdef ALLMEMS1_DEBUG_CONNECTION
      if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
        BytesToWrite = sprintf((char *)BufferToWrite,"--->AudioBeamForming=%s", (W2ST_CHECK_CONNECTION(W2ST_CONNECT_BF)   ? " ON\r\n\n" : " OFF\r\n\n"));
       Term_Update(BufferToWrite,BytesToWrite);
      } else {
        ALLMEMS1_PRINTF("--->AudioBeamForming=%s", (W2ST_CHECK_CONNECTION(W2ST_CONNECT_BF)   ? " ON\r\n\n" : " OFF\r\n\n"));
      }
  #endif /* ALLMEMS1_DEBUG_CONNECTION */ 
    }
  #endif /* ALLMEMS1_ACOUSTIC_BEAM_FORMING */
  //#ifdef STM32_SENSORTILE
  #if (defined(STM32_SENSORTILE) || defined(STM32_BLUECOIN))
     else if(attr_handle == GGCharHandle + 2){
       if (att_data[0] == 01) {
         W2ST_ON_CONNECTION(W2ST_CONNECT_GG_EVENT);
         /* Start the TIM Base generation in interrupt mode */
         if(HAL_TIM_Base_Start_IT(&TimEnvHandle) != HAL_OK){
           /* Starting Error */
           Error_Handler();
         }
         
         #ifdef STM32_BLUECOIN
         InitVoltageFilter= 1;
         #endif /* STM32_BLUECOIN */
         
