urzino/FanMonitoringBlueCoin/STM32CubeFunctionPack_ALLMEMS1_V3.2.0/Projects/Multi/Applications/ALLMEMS1/Src/sensor_service.c
       } else if (att_data[0] == 0){
         W2ST_OFF_CONNECTION(W2ST_CONNECT_GG_EVENT);
         /* Stop the TIM Base generation in interrupt mode */
         if(HAL_TIM_Base_Stop_IT(&TimEnvHandle) != HAL_OK){
           /* Stopping Error */
           Error_Handler();
         }
       }
  #ifdef ALLMEMS1_DEBUG_CONNECTION
       if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
         BytesToWrite =sprintf((char *)BufferToWrite,"---GG=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_GG_EVENT) ? " ON\r\n" : " OFF\r\n\n");
         Term_Update(BufferToWrite,BytesToWrite);
       } else
         ALLMEMS1_PRINTF("--->GG=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_GG_EVENT) ? " ON\r\n" : " OFF\r\n\n");
  #endif /* ALLMEMS1_DEBUG_CONNECTION */
    }
  #endif /* STM32_SENSORTILE */
    else if(attr_handle == ConfigCharHandle + 2){
      if (att_data[0] == 01) {
        FirstConnectionConfig=1;
      } else if (att_data[0] == 0){
        FirstConnectionConfig=0;
      }
  #ifdef ALLMEMS1_DEBUG_CONNECTION
      if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
        BytesToWrite =sprintf((char *)BufferToWrite,"--->Calib=%s\r\n\n", FirstConnectionConfig ? "ON" : "OFF");
       Term_Update(BufferToWrite,BytesToWrite);
      } else
        ALLMEMS1_PRINTF("--->Calib=%s\r\n\n", FirstConnectionConfig ? "ON" : "OFF");
  #endif /* ALLMEMS1_DEBUG_CONNECTION */
    } else if(attr_handle == AccGyroMagCharHandle + 2) {
      if (att_data[0] == 01) {
        W2ST_ON_CONNECTION(W2ST_CONNECT_ACC_GYRO_MAG);

        /* Start the TIM Base generation in interrupt mode */
        if(HAL_TIM_OC_Start_IT(&TimCCHandle, TIM_CHANNEL_4) != HAL_OK){
          /* Starting Error */
          Error_Handler();
        }

        /* Set the new Capture compare value */
        {
          uint32_t uhCapture = __HAL_TIM_GET_COUNTER(&TimCCHandle);
          /* Set the Capture Compare Register value */
          __HAL_TIM_SET_COMPARE(&TimCCHandle, TIM_CHANNEL_4, (uhCapture + uhCCR4_Val));
        }
      } else if (att_data[0] == 0) {
        W2ST_OFF_CONNECTION(W2ST_CONNECT_ACC_GYRO_MAG);

        /* Stop the TIM Base generation in interrupt mode */
        if(HAL_TIM_OC_Stop_IT(&TimCCHandle, TIM_CHANNEL_4) != HAL_OK){
          /* Stopping Error */
          Error_Handler();
        }      
      }
  #ifdef ALLMEMS1_DEBUG_CONNECTION
      if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
        BytesToWrite =sprintf((char *)BufferToWrite,"--->Acc/Gyro/Mag=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_ACC_GYRO_MAG) ? " ON\r\n" : " OFF\r\n\n");
        Term_Update(BufferToWrite,BytesToWrite);
      } else
        ALLMEMS1_PRINTF("--->Acc/Gyro/Mag=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_ACC_GYRO_MAG) ? " ON\r\n" : " OFF\r\n\n");
  #endif /* ALLMEMS1_DEBUG_CONNECTION */
    } else if(attr_handle == AccEventCharHandle + 2) {
      if (att_data[0] == 01) {
        W2ST_ON_CONNECTION(W2ST_CONNECT_ACC_EVENT);
        EnableHWMultipleEvents();
        ResetHWPedometer();
        Config_Notify(FEATURE_MASK_ACC_EVENTS,'m',1);
      } else if (att_data[0] == 0) {
        W2ST_OFF_CONNECTION(W2ST_CONNECT_ACC_EVENT);
        DisableHWMultipleEvents();
        //DisableHWFeatures();
      }
  #ifdef ALLMEMS1_DEBUG_CONNECTION
      if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
        BytesToWrite =sprintf((char *)BufferToWrite,"--->AccEvent=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_ACC_EVENT) ? " ON\r\n" : " OFF\r\n\n");
       Term_Update(BufferToWrite,BytesToWrite);
      } else
        ALLMEMS1_PRINTF("--->AccEvent=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_ACC_EVENT) ? " ON\r\n" : " OFF\r\n\n");
  #endif /* ALLMEMS1_DEBUG_CONNECTION */
    } else if(attr_handle == EnvironmentalCharHandle + 2){
      if (att_data[0] == 01) {
        W2ST_ON_CONNECTION(W2ST_CONNECT_ENV);

        /* Start the TIM Base generation in interrupt mode */
        if(HAL_TIM_Base_Start_IT(&TimEnvHandle) != HAL_OK){
          /* Starting Error */
          Error_Handler();
        }
        
        
        
  
      } else if (att_data[0] == 0){
        W2ST_OFF_CONNECTION(W2ST_CONNECT_ENV);

        /* Stop the TIM Base generation in interrupt mode */
        if(HAL_TIM_Base_Stop_IT(&TimEnvHandle) != HAL_OK){
          /* Stopping Error */
          Error_Handler();
        }
      }
  #ifdef ALLMEMS1_DEBUG_CONNECTION
      if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
        BytesToWrite =sprintf((char *)BufferToWrite,"--->Env=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_ENV) ? " ON\r\n" : " OFF\r\n\n");
       Term_Update(BufferToWrite,BytesToWrite);
      } else
        ALLMEMS1_PRINTF("--->Env=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_ENV) ? " ON\r\n" : " OFF\r\n\n");
  #endif /* ALLMEMS1_DEBUG_CONNECTION */
    } else if(attr_handle == StdErrCharHandle + 2){
      if (att_data[0] == 01) {
        W2ST_ON_CONNECTION(W2ST_CONNECT_STD_ERR);
      } else if (att_data[0] == 0){
        W2ST_OFF_CONNECTION(W2ST_CONNECT_STD_ERR);
      }
    } else if(attr_handle == TermCharHandle + 2){
      if (att_data[0] == 01) {
        W2ST_ON_CONNECTION(W2ST_CONNECT_STD_TERM);
      } else if (att_data[0] == 0){
        W2ST_OFF_CONNECTION(W2ST_CONNECT_STD_TERM);
      }
    } else if (attr_handle == TermCharHandle + 1){
      uint32_t SendBackData =1; /* By default Answer with the same message received */

      if(SizeOfUpdateBlueFW!=0) {
        /* FP-SNS-ALLMEMS1 firwmare update */
        int8_t RetValue = UpdateFWBlueMS(&SizeOfUpdateBlueFW,att_data, data_length,1);
        if(RetValue!=0) {
          MCR_FAST_TERM_UPDATE_FOR_OTA(((uint8_t *)&RetValue));
          if(RetValue==1) {
            /* if OTA checked */
            BytesToWrite =sprintf((char *)BufferToWrite,"The Board will restart in 5 seconds\r\n");
            Term_Update(BufferToWrite,BytesToWrite);
            ALLMEMS1_PRINTF("%s will restart in 5 seconds\r\n",ALLMEMS1_PACKAGENAME);
            HAL_Delay(5000);
            HAL_NVIC_SystemReset();
          }
        }
        SendBackData=0;
      } else {
        /* Received one write from Client on Terminal characteristc */
        SendBackData = DebugConsoleCommandParsing(att_data,data_length);
      }

      /* Send it back for testing */
      if(SendBackData) {
        Term_Update(att_data,data_length);
      }
    } else if (attr_handle == AudioLevelCharHandle + 2) {
      //uint8_t ret;
      if (att_data[0] == 01) {
        int32_t Count;
        //uint8_t ret;
        
        W2ST_ON_CONNECTION(W2ST_CONNECT_AUDIO_LEVEL);
        
