urzino/FanMonitoringBlueCoin/STM32CubeFunctionPack_ALLMEMS1_V3.2.0/Projects/Multi/Applications/ALLMEMS1/Src/sensor_service.c
#ifdef USE_STM32F4XX_NUCLEO
        /* Save the Meta Data Manager.
         * We had always a Meta Data Manager*/
        SaveMetaDataManager();
        NecessityToSaveMetaDataManager =0;
#endif /* USE_STM32F4XX_NUCLEO */

        /* Reduce the connection interval */
        {
          int ret = aci_l2cap_connection_parameter_update_request(connection_handle,
                                                        10 /* interval_min*/,
                                                        10 /* interval_max */,
                                                        0   /* slave_latency */,
                                                        400 /*timeout_multiplier*/);
          /* Go to infinite loop if there is one error */
          if (ret != BLE_STATUS_SUCCESS) {
            while (1) {
              ALLMEMS1_PRINTF("Problem Changing the connection interval\r\n");
            }
          }
        }
        
        /* Signal that we are ready sending back the CRV value*/
        BufferToWrite[0] = PointerByte[0];
        BufferToWrite[1] = PointerByte[1];
        BufferToWrite[2] = PointerByte[2];
        BufferToWrite[3] = PointerByte[3];
        BytesToWrite = 4;
        Term_Update(BufferToWrite,BytesToWrite);
      }
      
      SendBackData=0;      
    } else if(!strncmp("versionBle",(char *)(att_data),10)) {
      uint8_t  hwVersion;
      uint16_t fwVersion;
      /* get the BlueNRG HW and FW versions */
      getBlueNRGVersion(&hwVersion, &fwVersion);
      BytesToWrite =sprintf((char *)BufferToWrite,"%s_%d.%d.%c\r\n",
                            (hwVersion > 0x30) ? "BleMS" : "Ble",
                            fwVersion>>8, 
                            (fwVersion>>4)&0xF,
                            (hwVersion > 0x30) ? ('a'+(fwVersion&0xF)-1) : 'a');
      Term_Update(BufferToWrite,BytesToWrite);
      SendBackData=0;
#endif /* DISABLE_FOTA */
    } else if((att_data[0]=='u') & (att_data[1]=='i') & (att_data[2]=='d')) {
      /* Write back the STM32 UID */
      uint8_t *uid = (uint8_t *)STM32_UUID;
      uint32_t MCU_ID = STM32_MCU_ID[0]&0xFFF;
      BytesToWrite =sprintf((char *)BufferToWrite,"%.2X%.2X%.2X%.2X%.2X%.2X%.2X%.2X%.2X%.2X%.2X%.2X_%.3lX\r\n",
                            uid[ 3],uid[ 2],uid[ 1],uid[ 0],
                            uid[ 7],uid[ 6],uid[ 5],uid[ 4],
                            uid[11],uid[ 10],uid[9],uid[8],
                            MCU_ID);
      Term_Update(BufferToWrite,BytesToWrite);
      SendBackData=0;
#ifdef ALLMEMS1_ENABLE_SD_MEMS_RECORDING
      } else if(!strncmp("start",(char *)(att_data),5)) {
        
        if(!IsSdAudioRecording)
        {
          if(!IsSdMemsRecording)
          {
            LedOffTargetPlatform();
            openFile();
           
            if(!SD_CardNotPresent)
            {
              IsSdMemsRecording= 1;
              
              /* Start the TIM Base generation in interrupt mode */
              if(HAL_TIM_Base_Start_IT(&TimSdRecordingHandle) != HAL_OK){
                /* Starting Error */
                Error_Handler();
              }

              BytesToWrite =sprintf((char *)BufferToWrite,"Start Data Log MEMS Recording\r\n");
              Term_Update(BufferToWrite,BytesToWrite);
            }
            else
            {
              BytesToWrite =sprintf((char *)BufferToWrite,"SD Card not present\r\n");
              Term_Update(BufferToWrite,BytesToWrite);
              SD_CardNotPresent= 0;
              BSP_LED_Init(LED1);  
              BSP_LED_Off(LED1);
            }
          }
          else
          {
            BytesToWrite =sprintf((char *)BufferToWrite,"Data Log MEMS is already started\r\n");
            Term_Update(BufferToWrite,BytesToWrite);
          }
        }
        else
        {
          BytesToWrite =sprintf((char *)BufferToWrite,"Data Log Audio is already started\r\n");
          Term_Update(BufferToWrite,BytesToWrite);
          BytesToWrite =sprintf((char *)BufferToWrite,"It is need stopped the Data Log Audio before\r\n");
          Term_Update(BufferToWrite,BytesToWrite);
        }
        
        SendBackData=0;
      } else if(!strncmp("stop",(char *)(att_data),4)) {
        
        if(IsSdMemsRecording)
        {
          BytesToWrite =sprintf((char *)BufferToWrite,"Stop Data Log MEMS Recording\r\n");
          Term_Update(BufferToWrite,BytesToWrite);
          
          /* Stop the TIM Base generation in interrupt mode */
          if(HAL_TIM_Base_Stop_IT(&TimSdRecordingHandle) != HAL_OK){
            /* Stopping Error */
            Error_Handler();
          }
          
          closeFile();
          IsSdMemsRecording= 0;
          BSP_LED_Init(LED1);  
          LedOffTargetPlatform();
        }
        else
        {
          BytesToWrite =sprintf((char *)BufferToWrite,"None Data Log MEMS\r\n");
          Term_Update(BufferToWrite,BytesToWrite);          
        }
      
        SendBackData=0;
      } else if(!strncmp("AudioStart",(char *)(att_data),10)) {
        
        if(!IsSdMemsRecording)
        {
          if(!IsSdAudioRecording)
          {
            LedOffTargetPlatform();
            openFileAudio();
            
            if(!SD_CardNotPresent)
            {
              InitMics(AUDIO_SAMPLING_FREQUENCY, 64);
              
              IsSdAudioRecording= 1;

              BytesToWrite =sprintf((char *)BufferToWrite,"Start Data Log Audio Recording\r\n");
              Term_Update(BufferToWrite,BytesToWrite);
            }
            else
            {
              BytesToWrite =sprintf((char *)BufferToWrite,"SD Card not present\r\n");
              Term_Update(BufferToWrite,BytesToWrite);
              SD_CardNotPresent= 0;
              BSP_LED_Init(LED1);  
              LedOffTargetPlatform();
            }
          }
          else
          {
            BytesToWrite =sprintf((char *)BufferToWrite,"Data Log Audio is already started\r\n");
            Term_Update(BufferToWrite,BytesToWrite);
          }
        }
        else
        {
          BytesToWrite =sprintf((char *)BufferToWrite,"Data Log MEMS is already started\r\n");
          Term_Update(BufferToWrite,BytesToWrite);
          BytesToWrite =sprintf((char *)BufferToWrite,"It is need stopped the Data Log MEMS before\r\n");
          Term_Update(BufferToWrite,BytesToWrite);
        }
        
        SendBackData=0;
      } else if(!strncmp("AudioStop",(char *)(att_data),9)) {
        
