urzino/FanMonitoringBlueCoin/STM32CubeFunctionPack_ALLMEMS1_V3.2.0/Projects/Multi/Applications/ALLMEMS1/Src/sensor_service.c
        if(IsSdAudioRecording)
        {
          BytesToWrite =sprintf((char *)BufferToWrite,"Stop Data Log Audio Recording\r\n");
          Term_Update(BufferToWrite,BytesToWrite);
          
          DeInitMics();
          writeAudio_flag=0;
          closeFileAudio();   
          
          IsSdAudioRecording= 0;
          BSP_LED_Init(LED1);  
          LedOffTargetPlatform();
        }
        else
        {
          BytesToWrite =sprintf((char *)BufferToWrite,"None Data Log Audio\r\n");
          Term_Update(BufferToWrite,BytesToWrite);
        }
      
        SendBackData=0;
#endif /* ALLMEMS1_ENABLE_SD_MEMS_RECORDING */  
    }

  
#if 1

  /* If it's something not yet recognized... only for testing.. This must be removed*/
   if(SendBackData) {
    if(att_data[0]=='@') {

      if(att_data[1]=='T') {
        uint8_t loc_att_data[6];
        uint8_t loc_data_length=6;

        loc_att_data[0] = (FEATURE_MASK_TEMP1>>24)&0xFF;
        loc_att_data[1] = (FEATURE_MASK_TEMP1>>16)&0xFF;
        loc_att_data[2] = (FEATURE_MASK_TEMP1>>8 )&0xFF;
        loc_att_data[3] = (FEATURE_MASK_TEMP1    )&0xFF;
        loc_att_data[4] = 255;
        
        switch(att_data[2]) {
          case 'L':
            loc_att_data[5] = 50; /* @5S */
          break;
          case 'M':
            loc_att_data[5] = 10; /* @1S */
          break;
          case 'H':
            loc_att_data[5] = 1; /* @100mS */
          break;
          case 'D':
            loc_att_data[5] = 0; /* Default */
          break;
        }
        SendBackData = ConfigCommandParsing(loc_att_data,loc_data_length);
      } else if(att_data[1]=='A') {
        uint8_t loc_att_data[6];
        uint8_t loc_data_length=6;

        loc_att_data[0] = (FEATURE_MASK_ACC>>24)&0xFF;
        loc_att_data[1] = (FEATURE_MASK_ACC>>16)&0xFF;
        loc_att_data[2] = (FEATURE_MASK_ACC>>8 )&0xFF;
        loc_att_data[3] = (FEATURE_MASK_ACC    )&0xFF;
        loc_att_data[4] = 255;

        switch(att_data[2]) {
          case 'L':
            loc_att_data[5] = 50; /* @5S */
          break;
          case 'M':
            loc_att_data[5] = 10; /* @1S */
          break;
          case 'H':
            loc_att_data[5] = 1; /* @100mS */
          break;
          case 'D':
            loc_att_data[5] = 0; /* Default */
          break;
        }
        SendBackData = ConfigCommandParsing(loc_att_data,loc_data_length);
      } else if(att_data[1]=='M') {
        uint8_t loc_att_data[6];
        uint8_t loc_data_length=6;

        loc_att_data[0] = (FEATURE_MASK_MIC>>24)&0xFF;
        loc_att_data[1] = (FEATURE_MASK_MIC>>16)&0xFF;
        loc_att_data[2] = (FEATURE_MASK_MIC>>8 )&0xFF;
        loc_att_data[3] = (FEATURE_MASK_MIC    )&0xFF;
        loc_att_data[4] = 255;

        switch(att_data[2]) {
          case 'L':
            loc_att_data[5] = 50; /* @5S */
          break;
          case 'M':
            loc_att_data[5] = 10; /* @1S */
          break;
          case 'H':
            loc_att_data[5] = 1; /* @100mS */
          break;
          case 'D':
            loc_att_data[5] = 0; /* Default */
          break;
        }
        SendBackData = ConfigCommandParsing(loc_att_data,loc_data_length);
      }    
    }
  }
#endif
  
  return SendBackData;
}

/**
 * @brief  This function makes the parsing of the Configuration Commands
 * @param uint8_t *att_data attribute data
 * @param uint8_t data_length length of the data
 * @retval uint32_t SendItBack true/false
 */
static uint32_t ConfigCommandParsing(uint8_t * att_data, uint8_t data_length)
{
  FeatureMask = (att_data[3]) | (att_data[2]<<8) | (att_data[1]<<16) | (att_data[0]<<24);
  uint8_t Command = att_data[4];
  uint8_t Data    = att_data[5];
  uint32_t SendItBack = 1;

  switch (FeatureMask) {
#ifdef ALLMEMS1_ACOUSTIC_SOURCE_LOCALIZATION
    case FEATURE_MASK_DIR_OF_ARRIVAL:
      
      #ifdef ALLMEMS1_ACOUSTIC_BEAM_FORMING
      BF_toggleFlag=FALSE;
      #endif
      
      switch (Command) {
      case W2ST_COMMAND_SL_SENSITIVITY:
        
        
        switch(Data) {
        case W2ST_COMMAND_SL_HIGH:
          SetConfig_SL(SENSITIVITY_SL_HI_THRESHOLD);
          break;
        case W2ST_COMMAND_SL_LOW:
          SetConfig_SL(SENSITIVITY_SL_LOW_THRESHOLD);
          break;
        }
        
        break;
      }
    break;
#endif /* ALLMEMS1_ACOUSTIC_SOURCE_LOCALIZATION */
    
#ifdef ALLMEMS1_ACOUSTIC_BEAM_FORMING
    case FEATURE_MASK_BEAMFORMING:
       if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_BF))
       {
          switch (Command) {
            case W2ST_COMMAND_BF_TYPE:
              switch(Data) {
              case W2ST_COMMAND_BF_ASR_READY: 
                BeamFormingSetType(BF_ASR_READY);
                break;
              case W2ST_COMMAND_BF_STRONG:
                #ifndef STM32F401xE
                BeamFormingSetType(BF_STRONG);
                #endif /* ((!defined(STM32F401xE)) || (!defined(STM32F446xx))) */
                break;
              default:
                BeamFormingSetType(BF_ASR_READY);
              }
              break;
            case W2ST_COMMAND_BF_TOGGLE:
              switch(Data) {
                case W2ST_COMMAND_BF_ON:
                  BF_toggleFlag = TRUE;
                  DeInitMics();
                  InitMics(AUDIO_SAMPLING_FREQUENCY, BV_AUDIO_VOLUME_VALUE);
                  #ifdef STM32_NUCLEO
                  BV_SetInForBF();
                  #endif /* STM32_NUCLEO */
                  
    #ifdef STM32_BLUECOIN
                  BSP_LED_Off(LED1);
                  BSP_LED_Off(LED2);
                  BSP_LED_On(LED3);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED8);
    #endif /* STM32_BLUECOIN*/
                  BF_dir = 3; //RIGHT
                  BeamFormingDirectionSetup(BF_dir);
                  break;
                case W2ST_COMMAND_BF_OFF:
                  BF_toggleFlag = FALSE;
                  DeInitMics();
    #ifdef ALLMEMS1_ACOUSTIC_SOURCE_LOCALIZATION
                  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_SL))
                  {
                    InitMics(AUDIO_SAMPLING_FREQUENCY, BV_AUDIO_VOLUME_VALUE);
                  }
                  else
    #endif /* ALLMEMS1_ACOUSTIC_SOURCE_LOCALIZATION */
                  {
                    InitMics(BV_AUDIO_SAMPLING_FREQUENCY, BV_AUDIO_VOLUME_VALUE);
                  }
                  #ifdef STM32_NUCLEO
                  BV_SetOutForBF();
                  #endif /* STM32_NUCLEO */

    #ifdef STM32_BLUECOIN              
                  BSP_LED_Off(LED1);
                  BSP_LED_Off(LED2);
                  BSP_LED_Off(LED3);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED8);
    #endif /* STM32_BLUECOIN*/
                  break;
              }
              break;
              case W2ST_COMMAND_BF_CHANGEDIR:
              if(BF_toggleFlag == TRUE){
              switch(Data) {
    #ifdef STM32_BLUECOIN 
                case W2ST_COMMAND_BF_DIR1:
                  BF_dir = 1;
                  //2,4 - bl,tl
                  //1,3 - br,tr         
                  BSP_LED_On(LED1);
                  BSP_LED_Off(LED2);
                  BSP_LED_Off(LED3);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED8);
                  break;
                case W2ST_COMMAND_BF_DIR2:
                  BF_dir = 2;
                  //2,3 - bl,tr             
                  BSP_LED_Off(LED1);
                  BSP_LED_On(LED2);
                  BSP_LED_Off(LED3);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED8);
                  break;
    #endif /* STM32_BLUECOIN*/
                case W2ST_COMMAND_BF_DIR3:
                  BF_dir = 3;
                  //4,3 - tl,tr
                  //2,1 - bl,br
    #ifdef STM32_BLUECOIN 
                  BSP_LED_On(LED3);
                  BSP_LED_Off(LED2);
                  BSP_LED_Off(LED1);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED8);
    #endif /* STM32_BLUECOIN*/
                  break;
    #ifdef STM32_BLUECOIN 
                case W2ST_COMMAND_BF_DIR4:
                  BSP_LED_On(LED4);
                  BF_dir = 4;
                  //4,1 - tl,br
                  BSP_LED_Off(LED2);
                  BSP_LED_Off(LED3);
                  BSP_LED_Off(LED1);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED8);
                  break;
                case W2ST_COMMAND_BF_DIR5:
                  BSP_LED_On(LED5);
                  BF_dir = 5;
                  //3,1 - tr,br
                  //4,2 - tl,bl
                  BSP_LED_Off(LED2);
                  BSP_LED_Off(LED3);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED1);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED8);
                  break;
                case W2ST_COMMAND_BF_DIR6:
                  BSP_LED_On(LED6);
                  BF_dir = 6;
                  //3,2 - tr,bl
                  BSP_LED_Off(LED2);
                  BSP_LED_Off(LED3);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED1);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED8);
                  break;
    #endif /* STM32_BLUECOIN*/
                case W2ST_COMMAND_BF_DIR7:
                  BF_dir = 7;
                  //1,2 - br,bl
                  //3,4 - tr,tl
    #ifdef STM32_BLUECOIN 
                  BSP_LED_On(LED7);
                  BSP_LED_Off(LED2);
                  BSP_LED_Off(LED3);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED1);
                  BSP_LED_Off(LED8);
    #endif /* STM32_BLUECOIN*/
                  break;
    #ifdef STM32_BLUECOIN
                case W2ST_COMMAND_BF_DIR8:
                  BSP_LED_On(LED8);
                  BF_dir = 8;
                  //1,4 - br,tl
                  BSP_LED_Off(LED2);
                  BSP_LED_Off(LED3);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED1);
                  break;
    #endif /* STM32_BLUECOIN*/
              }
              BeamFormingDirectionSetup(BF_dir);
              }
              break; 
          }
       }//if check BF
    break;
#endif /* ALLMEMS1_ACOUSTIC_BEAM_FORMING */
    
    case FEATURE_MASK_SENSORFUSION_SHORT:
      /* Sensor Fusion */
      switch (Command) {
        case W2ST_COMMAND_CAL_STATUS:
#ifdef ALLMEMS1_DEBUG_CONNECTION
          if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
            BytesToWrite =sprintf((char *)BufferToWrite,"Calibration STATUS Signal For Features=%lx\n\r",FeatureMask);
            Term_Update(BufferToWrite,BytesToWrite);
          } else {
            ALLMEMS1_PRINTF("Calibration STATUS Signal For Features=%lx\n\r",FeatureMask);
          }
#endif /* ALLMEMS1_DEBUG_CONNECTION */
          /* Replay with the calibration status for the feature */
          /* Control the calibration status */
          {
            Config_Notify(FeatureMask,Command,isCal ? 100: 0);
            
